nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f80000evk/demo_apps/mc_pmsm/pmsm_snsless/pin_mux.c
/*
    * Copyright 2024 NXP
    *
    * SPDX-License-Identifier: BSD-3-Clause
*/

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v13.0
processor: MC56F80748
package_id: MC56F80748VLH
mcu_data: ksdk2_0
processor_version: 0.13.3
pin_labels:
- {pin_num: '13', pin_signal: GPIOA0/ANA0/CMPA_IN3/OPAMPA_IN3/CMPC_O, label: CUR_A}
- {pin_num: '14', pin_signal: GPIOA1/ANA1/CMPA_IN0/OPAMPA_IN0, label: CUR_C}
- {pin_num: '16', pin_signal: GPIOA3/ANA3/VREFLA/CMPA_IN2, label: CUR_C}
- {pin_num: '24', pin_signal: GPIOB0/ANB0/CMPB_IN3/OPAMPB_IN3, label: CUR_B}
- {pin_num: '15', pin_signal: GPIOA2/ANA2/VREFHA/CMPA_IN1, label: VOLT_DCB}
- {pin_num: '28', pin_signal: GPIOB3/ANB3/VREFLB/CMPC_IN0, label: CUR_C}
- {pin_num: '27', pin_signal: GPIOB2/ANB2/CMPC_IN3, label: CUR_DCB}
- {pin_num: '3', pin_signal: GPIOC0/EXTAL/CLKIN0, label: EXTAL, identifier: EXTAL}
- {pin_num: '4', pin_signal: GPIOC1/XTAL, label: XTAL, identifier: XTAL}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_sim.h"
#include "fsl_gpio.h"
#include "fsl_xbara.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitQSCI();
    BOARD_InitGPIO();
    BOARD_InitPWMA();
    BOARD_InitADC();
    BOARD_CMPC();
    BOARD_OCCS();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitQSCI:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '7', peripheral: QSCI0, signal: RXD, pin_signal: GPIOC3/TA0/CMPA_O/RXD0/CLKIN1}
  - {pin_num: '5', peripheral: QSCI0, signal: TXD, pin_signal: GPIOC2/TXD0/XB_OUT11/XB_IN2/CLKO0}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitQSCI
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitQSCI(void)
{
    /* GPIOC IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOC);
    /* Enable peripheral functionality on pin GPIOC2 (pin 5) */
    GPIO_PinSetPeripheralMode(GPIOC, kGPIO_Pin2, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC2 (pin 5) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C2_TXD0);
    /* Enable peripheral functionality on pin GPIOC3 (pin 7) */
    GPIO_PinSetPeripheralMode(GPIOC, kGPIO_Pin3, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC3 (pin 7) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C3_RXD0);

    /* Internal Peripheral Select */
    /* Select SCI0_RXD Input.: Select SCI0_RXD Input, GPIOC3 or GPIOC8 or GPIOF8. */
    SIM_SetInternalPeriInput(SIM, kSIM_SCI0_RXDInputIndex, kSIM_SCI0_RXDInput_GPIOC3_GPIOC8_GPIOF8);

}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitGPIO:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '41', peripheral: GPIOF, signal: 'GPIO, 4', pin_signal: GPIOF4/TXD1/XB_OUT8/PWMA_0X/PWMA_FAULT6, direction: OUTPUT}
  - {pin_num: '58', peripheral: GPIOF, signal: 'GPIO, 6', pin_signal: GPIOF6/ANB4f/PWMA_3X/XB_IN2, direction: OUTPUT}
  - {pin_num: '53', peripheral: GPIOE, signal: 'GPIO, 6', pin_signal: GPIOE6/PWMA_3B/XB_IN4/ANB4e/XB_OUT10, direction: INPUT, gpio_interrupt: gpioIrqFallingEdge}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitGPIO
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitGPIO(void)
{
    /* GPIOE IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOE);
    /* GPIOF IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOF);
    /* GPIO functionality on pin GPIOE6 (pin 53) */
    GPIO_PinSetPeripheralMode(GPIOE, kGPIO_Pin6, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOF4 (pin 41) */
    GPIO_PinSetPeripheralMode(GPIOF, kGPIO_Pin4, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOF6 (pin 58) */
    GPIO_PinSetPeripheralMode(GPIOF, kGPIO_Pin6, kGPIO_ModeGpio);

    /* Initialize GPIO functionality on pin GPIOE6 (pin 53)  */
    GPIO_PinSetDirection(GPIOE, kGPIO_Pin6, kGPIO_DigitalInput);

    /* Initialize GPIO functionality on pin GPIOF4 (pin 41)  */
    GPIO_PinWrite(GPIOF, kGPIO_Pin4, kGPIO_OutputLow);
    GPIO_PinSetDirection(GPIOF, kGPIO_Pin4, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOF6 (pin 58)  */
    GPIO_PinWrite(GPIOF, kGPIO_Pin6, kGPIO_OutputLow);
    GPIO_PinSetDirection(GPIOF, kGPIO_Pin6, kGPIO_DigitalOutput);

    /* Interrupt configuration on GPIOE6 (pin 53): Interrupt on falling edge */
    GPIO_PinSetInterruptConfig(GPIOE, kGPIO_Pin6, kGPIO_InterruptFallingEdge);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPWMA:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '46', peripheral: PWMA, signal: 'A, 0', pin_signal: GPIOE1/PWMA_0A/XB_OUT5}
  - {pin_num: '45', peripheral: PWMA, signal: 'B, 0', pin_signal: GPIOE0/PWMA_0B/XB_OUT4}
  - {pin_num: '48', peripheral: PWMA, signal: 'A, 1', pin_signal: GPIOE3/PWMA_1A/XB_OUT7}
  - {pin_num: '47', peripheral: PWMA, signal: 'B, 1', pin_signal: GPIOE2/PWMA_1B/XB_OUT6}
  - {pin_num: '52', peripheral: PWMA, signal: 'A, 2', pin_signal: GPIOE5/PWMA_2A/XB_IN3/XB_OUT9}
  - {pin_num: '51', peripheral: PWMA, signal: 'B, 2', pin_signal: GPIOE4/PWMA_2B/XB_IN2/XB_OUT8}
  - {peripheral: PWMA, signal: 'FAULT, 0', pin_signal: CMPC_OUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPWMA
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPWMA(void)
{
    /* GPIOE IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOE);
    /* Enable peripheral functionality on pin GPIOE0 (pin 45) */
    GPIO_PinSetPeripheralMode(GPIOE, kGPIO_Pin0, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOE0 (pin 45) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_E0_PWMA_0B);
    /* Enable peripheral functionality on pin GPIOE1 (pin 46) */
    GPIO_PinSetPeripheralMode(GPIOE, kGPIO_Pin1, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOE1 (pin 46) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_E1_PWMA_0A);
    /* Enable peripheral functionality on pin GPIOE2 (pin 47) */
    GPIO_PinSetPeripheralMode(GPIOE, kGPIO_Pin2, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOE2 (pin 47) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_E2_PWMA_1B);
    /* Enable peripheral functionality on pin GPIOE3 (pin 48) */
    GPIO_PinSetPeripheralMode(GPIOE, kGPIO_Pin3, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOE3 (pin 48) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_E3_PWMA_1A);
    /* Enable peripheral functionality on pin GPIOE4 (pin 51) */
    GPIO_PinSetPeripheralMode(GPIOE, kGPIO_Pin4, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOE4 (pin 51) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_E4_PWMA_2B);
    /* Enable peripheral functionality on pin GPIOE5 (pin 52) */
    GPIO_PinSetPeripheralMode(GPIOE, kGPIO_Pin5, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOE5 (pin 52) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_E5_PWMA_2A);
    /* CMPC_OUT output assigned to XBARA_IN14 input is connected
     * to XBARA_OUT29 output assigned to PWMA_FAULT0 */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputCmpcOut, kXBARA_OutputPwmaFault0);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitADC:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '24', peripheral: ADC, signal: 'ANB, 0', pin_signal: GPIOB0/ANB0/CMPB_IN3/OPAMPB_IN3}
  - {pin_num: '13', peripheral: ADC, signal: 'ANA, 0', pin_signal: GPIOA0/ANA0/CMPA_IN3/OPAMPA_IN3/CMPC_O}
  - {pin_num: '28', peripheral: ADC, signal: 'ANB, 3', pin_signal: GPIOB3/ANB3/VREFLB/CMPC_IN0}
  - {pin_num: '16', peripheral: ADC, signal: 'ANA, 3', pin_signal: GPIOA3/ANA3/VREFLA/CMPA_IN2}
  - {pin_num: '15', peripheral: ADC, signal: 'ANA, 2', pin_signal: GPIOA2/ANA2/VREFHA/CMPA_IN1}
  - {peripheral: ADC, signal: 'SYNC, 0', pin_signal: PWMA0_OUT_TRIG0}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitADC
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitADC(void)
{
    /* GPIOA IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOA);
    /* GPIOB IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOB);
    /* Enable peripheral functionality on pin GPIOA0 (pin 13) */
    GPIO_PinSetPeripheralMode(GPIOA, kGPIO_Pin0, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOA0 (pin 13) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_A0_ANA0_and_CMPA_IN3_and_OPAMPA_IN3);
    /* Enable peripheral functionality on pin GPIOA2 (pin 15) */
    GPIO_PinSetPeripheralMode(GPIOA, kGPIO_Pin2, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOA3 (pin 16) */
    GPIO_PinSetPeripheralMode(GPIOA, kGPIO_Pin3, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOB0 (pin 24) */
    GPIO_PinSetPeripheralMode(GPIOB, kGPIO_Pin0, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOB3 (pin 28) */
    GPIO_PinSetPeripheralMode(GPIOB, kGPIO_Pin3, kGPIO_ModePeripheral);
    /* PWMA0_OUT_TRIG0 output assigned to XBARA_IN28 input is connected
     * to XBARA_OUT12 output assigned to ADC_SYNC0 */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputPwma0OutTrig0, kXBARA_OutputAdcSync0);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_CMPC:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '27', peripheral: CMPC, signal: 'IN, 3', pin_signal: GPIOB2/ANB2/CMPC_IN3}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_CMPC
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_CMPC(void)
{
    /* GPIOB IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOB);
    /* Enable peripheral functionality on pin GPIOB2 (pin 27) */
    GPIO_PinSetPeripheralMode(GPIOB, kGPIO_Pin2, kGPIO_ModePeripheral);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_OCCS:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '3', peripheral: OCCS, signal: EXTAL, pin_signal: GPIOC0/EXTAL/CLKIN0}
  - {pin_num: '4', peripheral: OCCS, signal: XTAL, pin_signal: GPIOC1/XTAL}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_OCCS
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_OCCS(void)
{
    /* GPIOC IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOC);
    /* Enable peripheral functionality on pin GPIOC0 (pin 3) */
    GPIO_PinSetPeripheralMode(BOARD_OCCS_EXTAL_GPIO, BOARD_OCCS_EXTAL_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC0 (pin 3) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C0_EXTAL);
    /* Enable peripheral functionality on pin GPIOC1 (pin 4) */
    GPIO_PinSetPeripheralMode(BOARD_OCCS_XTAL_GPIO, BOARD_OCCS_XTAL_PIN_MASK, kGPIO_ModePeripheral);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
